<a href="https://colab.research.google.com/github/UKD1211/DataScience_Slogbook_ISI_placement_prep/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

https://pandas.pydata.org/about/index.html

### Pandas Series

A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

In [1]:
# importing pandas
import numpy as np
import pandas as pd

# **Series from List**

In [2]:
#string
country = ['india','pakistan','usa','nepal','srilanka']
pd.Series(country)

0       india
1    pakistan
2         usa
3       nepal
4    srilanka
dtype: object

In [3]:
#in the series it has 2 parts the index and its values

In [4]:
#interger

runs = [12,22,131,45,11]
pd.Series(runs)

0     12
1     22
2    131
3     45
4     11
dtype: int64

In [5]:
#custom index

marks = [55,67,89,100]
subjects = ['maths','english','science','hindi']

pd.Series(marks,index = subjects)

maths       55
english     67
science     89
hindi      100
dtype: int64

In [18]:
# setting a name
marks = pd.Series(marks,index = subjects,name = 'uttam ke marks')

In [19]:
marks

maths       55
english     67
science     89
hindi      100
Name: uttam ke marks, dtype: int64

In [ ]:
#series from dict

In [22]:
marks = {
    "maths":55,
    "english":67,
    "science":89,
    "hindi":100
}

marks_series = pd.Series(marks, name = "marks")

# **Series Attributes**

In [23]:
#size -> how many items in series
marks_series

maths       55
english     67
science     89
hindi      100
Name: marks, dtype: int64

In [24]:
marks_series.size

4

In [25]:
#dtype
marks_series.dtype

dtype('int64')

In [26]:
# name
marks_series.name

'marks'

In [27]:
#is_unique  -> all the items are here are uniqueor not
marks_series.is_unique

True

In [29]:
pd.Series([1,1,2,1,1,2,1]).is_unique

False

In [30]:
#index
marks_series.index

Index(['maths', 'english', 'science', 'hindi'], dtype='object')

In [31]:
#values
marks_series.values

array([ 55,  67,  89, 100])

# **Series Using Read CSV**

In [7]:
#with one col
pd.read_csv('/content/subs.csv')

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [8]:
type(pd.read_csv('/content/subs.csv'))

pandas.core.frame.DataFrame

In [9]:
# so ita stored as a dataframe here lol, not a series

In [10]:
# for series
subs = pd.read_csv('/content/subs.csv', usecols=['Subscribers gained']).squeeze("columns")
display(subs.head())

0    48
1    57
2    40
3    43
4    44
Name: Subscribers gained, dtype: int64

In [11]:
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [18]:
import pandas as pd
runs = pd.read_csv('/content/kohli_ipl.csv', index_col = 'match_no').squeeze("columns")
runs

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [23]:
bollywood = pd.read_csv('/content/bollywood.csv',index_col = 'movie').squeeze("columns")

In [24]:
bollywood

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

# **Series Methods**

In [25]:
#head and tail - > just data preview

In [26]:
subs.head()

0    48
1    57
2    40
3    43
4    44
Name: Subscribers gained, dtype: int64

In [28]:
bollywood.head(13)

movie
Uri: The Surgical Strike                       Vicky Kaushal
Battalion 609                                    Vicky Ahuja
The Accidental Prime Minister (film)             Anupam Kher
Why Cheat India                                Emraan Hashmi
Evening Shadows                             Mona Ambegaonkar
Soni (film)                             Geetika Vidya Ohlyan
Fraud Saiyaan                                   Arshad Warsi
Bombairiya                                      Radhika Apte
Manikarnika: The Queen of Jhansi              Kangana Ranaut
Thackeray (film)                         Nawazuddin Siddiqui
Amavas                                             Ali Asgar
Gully Boy                                      Ranveer Singh
Hum Chaar                                        Prit Kamani
Name: lead, dtype: object

In [29]:
subs.tail()

360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, dtype: int64

In [35]:
#sample - > randomly one row from data

bollywood.sample(5)

movie
Ekkees Toppon Ki Salaami         Anupam Kher
Memories in March               Deepti Naval
Gandhi My Father              Akshaye Khanna
The Train (2007 film)          Emraan Hashmi
Aur Pappu Paas Ho Gaya      Krishna Abhishek
Name: lead, dtype: object

In [36]:
#value_count -> movies
bollywood

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [38]:
# each values er frequency count , je value ta data te kotobaar ache

In [39]:
bollywood.value_counts()

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [50]:
# sort_values -> inplace ->vk highest score in ipl
print(runs.sort_values(ascending = False).head(1).values[0])   #method chaining

113

In [51]:
runs.sort_values(ascending = False)

match_no
128    113
126    109
123    108
120    100
164    100
      ...
93       0
130      0
206      0
207      0
211      0
Name: runs, Length: 215, dtype: int64

In [52]:
runs

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [53]:
# for permanent changes -> inplace = True #inplace not available here

In [56]:
runs = runs.sort_values()

In [57]:
runs

match_no
8        0
87       0
93       0
91       0
206      0
      ...
164    100
120    100
123    108
126    109
128    113
Name: runs, Length: 215, dtype: int64

In [61]:
# sort_index -> it will sort the indexes
bollywood.sort_index()

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object

# **Series Maths Methods**

In [62]:
# count -> total no of items in series -> but it will not count missing values

In [63]:
runs.count()

np.int64(215)

In [64]:
# sum-> product
subs.sum()

np.int64(49510)

In [65]:
# mean->median->mode->std->var

subs.mean()

np.float64(135.64383561643837)

In [66]:
runs.median()

24.0

In [67]:
print(bollywood.mode())

0    Akshay Kumar
Name: lead, dtype: object

In [68]:
print(subs.std())

62.67502303725269

In [69]:
print(runs.var())

688.0024777222342

In [71]:
# min/max
subs.min()
subs.max()

396

In [72]:
# describe  -> kind off boxplot, or 5 number summary type
runs.describe()

count    215.000000
mean      30.855814
std       26.229801
min        0.000000
25%        9.000000
50%       24.000000
75%       48.000000
max      113.000000
Name: runs, dtype: float64

In [73]:
subs.describe()

count    365.000000
mean     135.643836
std       62.675023
min       33.000000
25%       88.000000
50%      123.000000
75%      177.000000
max      396.000000
Name: Subscribers gained, dtype: float64